## 준비과정
작년 여름에 같은 동아리를 하는 친한 동생을 통해 네이버 부스트캠프에 대해서 처음 알았다. 그 당시에 나는 코딩을 본격적으로 시작한지 3개월쯤 지난 상태여서 코딩 실력도 기초 수준이었고 어떤 것부터 공부를 해야하는 지도 잘 모르는 막막한 상태였다. 부스트 캠프에 합격만 한다면 더 대단한 사람들과 공부도 같이할 수 있고, 스스로 개발 실력도 많이 늘 것만 같았다. 목표가 생기면 수단을 가리지 않고 몰입하는 성격이기 때문에 뭐부터 해야할 지 모르는 막막한 상황에서 우선 2023년 네이버 부스트캠프 캠프 합격이라는 목표를 갖고 그거에 맞춰서 공부를 하고자 하였다.

부스트캠프 교육생 선별 과정은 크게 서류와 코딩테스트 1차, 코딩테스트 2차가 있었다. 5기까지만 하더라도 코딩테스트의 난이도가 그렇게 높지는 않았다고 들었었다(별찍기만 할 줄 알면 된다라고 하신 분도 있었다 ㅎㅎ). 하지만 점점 코딩테스트의 난이도도 높아지고 심지어 작년에는 CS문제도 추가되어서 체감 난이도는 극상이라고 하였다.
올해 3월부터 본격적인 부스트캠프 준비를 하였는데 자바스크립트로 코딩테스트를 준비하기에는 기존에 이용하던 백준 프로그램이 readline 모듈을 사용해서 초기에 준비할 것이 복잡해보였고, 실제 코딩테스트 환경도 프로그래머스 환경이라고 해서 이런저런 이유로 프로그래머스부터 시작하였다. JS로 어떻게 코테를 푸는지 아예 몰랐었기 때문에 0레벨부터 차근차근 풀기 시작하였다. 차근차근 풀면서 자바스크립트 메서드에 대해서도 공부를 하고 다양한 문법 공부도 많이 했었다. 정말 매일 매일 시험 당일을 제외하고는 거의 시험기간에도 매일 1문제 이상은 풀었던 것 같다. 그래서 부스트캠프 코딩테스트를 보기 전까지 283개를 풀었던 것 같다. 나는 정답률이 높은 순서대로 문제를 풀었는데  lv.0 98%부터 시작해서 lv.2 50%대 문제까지는 접해본 것 같다. 작년 코딩테스트를 접한 사람은 코테 난이도가 lv1~2 라고 해서 이정도만 준비해도 코테는 무난하게 볼 수 있을 거라고 생각했다.
![](https://velog.velcdn.com/images/jaeochoiii/post/1483e84d-33a7-4170-926e-7514b73e9adb/image.png)

![](https://velog.velcdn.com/images/jaeochoiii/post/e0ebb8d1-6399-4d85-8371-c657dfca6623/image.png)

그리고 CS 시험을 대비하기 위해서 CS 면접 관련 서적도 구매하였지만 학교에서 배우는 내용만큼 deep하지 않아서 그닥 추천을 하지는 않는다. 그리고 검색이 가능하기 때문에 전공자가 아니라면 어떤 키워드들이 있는지 정도만 알면 될 것 같다.

## 지원서 작성
네이버 부스트캠프 8기 모집 공고가 떴을 때부터 자소서를 작성하였다. 나는 성격상 과제나 해야할 일이 밀려있는 것을 못참는 성격이다. 자소서 역시 마감 직전까지 질질 끄는 것을 싫어해서 매번 바로바로 쓰고 거의 첫번째로 제출하고는 했다. 하지만 주변 사람들을 보니 정말 마감 직전까지 본인이 작성한 글을 다듬고 다듬어서 정말 거의 완벽하게 글을 작성하는 것을 보고 저렇게 해야 좋은 글이 나오는 것을 느낄 수 있었다. 이번에는 자소서 작성하는 기간이 학교 기말고사와 겹쳤기 때문에 미리미리 계획을 짜서 몇번을 읽어보고 수정하고를 반복해서 마감 이틀 전에 최종본을 제출하였다.

자소서 질문은 어디에도 검색하면 나오겠지만 지원동기나, 알고 있는 내용을 공유한 경험 등 예상 가능한 질문들이었다. 우선 일년 넘게 블로그에 내 경험과 배운 것들을 기록하는 것을 큰 장점으로 내세워 글을 써내려갔고, 지원동기는 최대한 네이버 부스트캠프에서 원하는 인재상을 엮어서 글에 녹이려고 했던 것 같다. 그리고 추가적인 이야기지만 **경험에 대해서는 최대한 프로그래밍에 관련된 내용을 적는 것이 유리하다고 생각한다.** 동아리 자소서를 운영진 입장에서 본 경험이 있는데 남자면 다들 군대때 이야기를 하고 고등학교때 입시 이야기를 많이 적는다. 그렇게 누구나 하는 경험 말고 나만의 특별한 경험을 담아내는 것이 중요하다고 생각한다.
![](https://velog.velcdn.com/images/jaeochoiii/post/e7a6450e-c4e9-43ba-a8c3-b74da80f103b/image.png)
그리고 1차 코딩테스트 한 5일 전? 쯤에 이런 메일이 도착한다. 올해부터는 자소서에서도 불성실하게 답변을 하는 인원들은 코딩테스트 자격조차 주어지지 않는다고 하니 이 점 참고하면 좋을 것 같다.

## 1차 코딩테스트
1차 코딩테스트는 저녁 7시부터 2시간 정도 진행되었던 것 같다. 나한테는 개발자의 길을 가기로 마음먹고 처음 보는 코딩테스트였기 때문에 무척 긴장이 되었다. 시험을 보기 전에 정말 놀랐던 것은 프로그래머스 사이트를 통해서 시험을 보는데 자동적으로 화면 공유도 이루어지고 핸드폰으로는 내가 시험보는 화면이 동시에 녹화가 되고 있어서 '구글미트'나 '줌'처럼 동시접속으로 잡소리가 들리지도 않고 온전히 시험에만 집중할 수 있는 환경이었다.

문제 유출관련 때문에 자세하게 말할 수는 없지만 두문제가 알고리즘 문제였고, 나머지 10문제가 CS문제였다. 알고리즘 문제 하나는 대체 무슨 말을 하는지 몰라서 하드코딩을 하려고 했지만 그것 마저도 줄이 너무 길게나와서 실패하였고 나머지 한문제에만 집중하였다. 전날에 카카오 인턴쉽 문제였던 '키패드 누르기' 문제를 풀었는데 이것처럼 뭔가 예외처리도 많이 해야하고 조건도 매우 까다로웠다. **두문제 모두 프로그래머스 기준 정답률 낮은 lv1정도는 되는 것 같다.** 그래도 테스트 케이스는 통과해서 **1솔은 했다...** 하지만 1차 코딩테스트임에도 불구하고 꽤 난이도가 있었던 것 같다. CS 10문제는 진짜 직전학기에 CS 3과목을 들었음에도 불구하고 확신을 가지고 풀 수 있는 문제는 한문제도 없었던 것 같다. 검색을 해도 나오지 않는...왜 검색이 가능하다고 하는 지 알 수 있는 문제들로 구성되었다.

시험이 끝나고 1솔은 했기 때문에 1차는 붙지 않을까 생각은 들었다. 허수가 많을 수 있다고 생각이 들어서 1솔은 했고... CS도 한두문제는 맞추지 않았을까 하는 생각으로 은근 기대를 하면서 기다렸다. 그 다음날에 제주도로 여행을 갔는데 제주도에서 메일로 1차 코딩테스트 합격 문자를 받았다. 그 짜릿함은 정말 아직도 기억에 생생하다.
![](https://velog.velcdn.com/images/jaeochoiii/post/830e047f-6405-4bba-b8b4-76bea9839727/image.png)

## 2차 코딩테스트 
이제부터는 살짝 마음이 쫄리기 시작했다. 허수는 1차에서 걷어낼 만큼 걷어낸 것 같고... 진짜들의 싸움이라고 생각이 들었다. 실제로 여러 블로그의 글을 보니까 1차때 2솔 한 사람들도 생각보다 많이 떨어졌다고 한다. CS도, 자소서도 크게 반영이 된 것 같다.

2차 코딩테스트는 1차 결과가 나오고 3일 뒤에 이루어지는 것이어서 실질적으로 준비하는 시간이 부족했다. 그래도 전날에만 카카오 공채 문제 포함 5문제 정도를 풀고 2차 코테를 봤다. 사실 어려워봤자 lv2 정도 문제라고 생각을 하고 대비했던 것 같다.

2차 코테는 2시간 반동안 이루어졌는데 총 6문제로 3문제는 알고리즘 문제, 나머지 3문제는 그 알고리즘에 대한 풀이 설명이었다. 1번과 2번, 3번 문제 전부 문제 길이가 너무 길었고 사람을 당황하게 만들었다. 내가 프로그래머스를 200문제 넘게 풀었지만 이 문제는 처음보는 유형이었고 가장 어려운 3문제였다. 1번을 풀다가 어려워서 2번을 풀려고 했지만 2번도 풀다보니까 어려웠고, 3번으로 넘어갔다. 이렇게 제대로 문제를 풀지도 못하고 30분을 낭비했다. 그리고 1번을 풀었는데 1번 역시 당황스러워서 클린코드로 구현하지 못하고 거의 하드코딩을 하여 제출하였다. 1번을 풀고 2번을 풀려고 하니 40분이 남아있었다. 2번을 풀다보니 생각보다 할만 한 문제였다. 하지만 시간이...너무나도 부족했다.**모든 문제가 프로그래머스 기준으로 lv2~3은 되는 것 같았다.** 처음에 30분을 낭비하지 않았더라면 이런 일은 없었을 텐데.... 너무나 후회가 됐다. 그렇게 급하게 내가 작성한 코드에 대한 서술을 하니까 시험이 끝나버렸다. 내가 19학년도 수능을 봤는데 그해 국어가 정말 어려웠었다. 딱 그 시험을 본 느낌을 받았다. 최종적으로는 ** 1솔...** 합격권은 2솔은 되어야 할텐데... 다른 사람들은 2솔이 꽤 많았다. 1솔도 가능성이 있지 않을까 했지만 2차 코딩테스트는 코드가 돌아가는 것 뿐만 아니라 코드를 얼마나 깔끔하게 작성했는 지도 보는 것 같았다. 그렇게 생각하면 거의 0솔에 가까운 내 코드였다.
![](https://velog.velcdn.com/images/jaeochoiii/post/dca53fc3-a2cc-4fb6-98a6-2a071fd20555/image.png)

+++ 7월 4일. 예정된 날짜보다 하루 빨리 결과가 나왔다. 떨어질 것 같다는 생각이 강하게 들었지만 5% 정도의 희망을 갖고 있었다. 하지만 결과는 역시...
![](https://velog.velcdn.com/images/jaeochoiii/post/15c56be8-71de-4644-a72b-813f0af5c029/image.png)
미련도 없다. 이 결과를 계기로 아직 많이 부족하다는 점을 깨닫고 더 성장하는 개발자가 되야한다는 생각이 들었다.

## 느낀점
이 글을 쓰는 시점은 2차 코테를 본 다음 날이다. 어제 하루는 준비를 오랫동안 해서 그런 것일지는 몰라도 나 스스로 어제 30분을 통째로 날려버린 것에 대한 후회가 너무 컸다. 그리고 스스로 코딩테스트를 풀면서 자만심도 생겼던 것 같다. 고작 lv1, lv2문제를 풀면서 나 스스로를 너무 과대평가한 것 같았다.

붙을거라는 생각은 하지 않는다. 다만 나에게는 이 경험이 너무나 소중했다. 세상에는 정말 나보다 잘하는 사람들이 많다는 것을 새삼 느낄 수 있었고, 사람들의 수준은 날이 가면 갈수록 높아져만 간다. 아마 내년에는 더 어렵지 않을까 하는 생각도 든다. 어떻게 첫술에 배부를 수가 있을까? 이것을 기점으로 더 열심히 해서 더 준비된 모습으로 내년 부스트캠프를 한번 더 도전하려고 한다. 
